///// DB에 저장이 되는 항목인 경우 CMB_CONST_XXXXX 의 형태로 CONST를 붙임.

// Member Use Type
CMB_MAIN_MEMB_USE_TYPE_DWGRPRT                = "Dwg & Report"
CMB_MAIN_MEMB_USE_TYPE_DWGONLY                = "Dwg Only"
CMB_MAIN_MEMB_USE_TYPE_RPTONLY                = "Report Only"
CMB_MAIN_MEMB_USE_TYPE_NOT_USE                = "None"
CMB_MAIN_MEMB_USE_TYPE_BYMEMBR                = "By Member"

// Direction
CMB_MAIN_DIRECTION_X                          = "X-Dir"
CMB_MAIN_DIRECTION_Y                          = "Y-Dir"
CMB_MAIN_DIRECTION_Z                          = "Z-Dir"

// Support Type
CMB_MAIN_SUPPORT_TYPE_FREE                    = "Free"
CMB_MAIN_SUPPORT_TYPE_PIN                     = "Pin"
CMB_MAIN_SUPPORT_TYPE_FIX                     = "Fix"
CMB_MAIN_SUPPORT_TYPE_SEMI                    = "Semi"

/////// DB에 저장되는 문자열임. 변경 불가 ///////
// Support Type for DB ( Do not Translate. )
CMB_CONST_MAIN_SUPPORT_TYPE_PIN               = "Pin"
CMB_CONST_MAIN_SUPPORT_TYPE_FIX               = "Fix"
CMB_CONST_MAIN_SUPPORT_TYPE_SEMI              = "Semi"
CMB_CONST_MAIN_SUPPORT_TYPE_FREE              = "Free"

// Lateral Force Resisting System Type
CMB_MAIN_LFRS_TYPE_SPECIAL_MOMENT             = "Special Moment Frames"
CMB_MAIN_LFRS_TYPE_INTERMEDIATE_MOMENT        = "Intermediate Moment Frames"
CMB_MAIN_LFRS_TYPE_ORDINARY_MOMENT            = "Ordinary Moment Frames"
CMB_MAIN_LFRS_TYPE_SPECIAL_CONCEN_BRACED      = "Special Concentrically Braced Frames"
CMB_MAIN_LFRS_TYPE_ORDINARY_CONCEN_BRACED     = "Ordinary Concentrically Braced Frames"
CMB_MAIN_LFRS_TYPE_ECCENTRICALLY_BRACED       = "Eccentrically Braced Frames"
CMB_MAIN_LFRS_TYPE_BUCKLING_RESTRAINED_BRACED = "Buckling-Restrained Braced Frames"
CMB_MAIN_LFRS_TYPE_SPECIAL_PLATE_SHEAR_WALL   = "Special Plate Shear Walls"

CMB_MAIN_KFACTOR_TYPE_PIN_PIN                 = "Pin-Pin"
CMB_MAIN_KFACTOR_TYPE_FIX_FIX                 = "Fix-Fix"

CMB_MAIN_DECK_DIR_PERPENDI_TO_BEAM            = "Perpendicular to Beam"
CMB_MAIN_DECK_DIR_PARALLEL_TO_BEAM            = "Parallel to Beam"

CMB_MAIN_SUPPORT_TYPE_SUPPORTED               = "Supported"
CMB_MAIN_SUPPORT_TYPE_NOTSUPPRT               = "Not Supported"

// Stress-Strain Relation
CMB_MAIN_STRS_STRN_EQIV_RECT                  = "Equivalent Rectangle"
CMB_MAIN_STRS_STRN_PARA_EQIV                  = "Parabola-Rectangle ( Average )"
CMB_MAIN_STRS_STRN_PARA_REAL                  = "Parabola-Rectangle ( Detail )"

///// Member Sort Type ( Batch Beam )
CMB_BEAM_SORT_TYPE_SORT_NO                    = "Story / Grouping"
CMB_BEAM_SORT_TYPE_STRN_RA                    = "Critical Ratio"
CMB_BEAM_SORT_TYPE_STRN_PN                    = "Axial Ratio"
CMB_BEAM_SORT_TYPE_STRN_MN                    = "Moment Ratio"
CMB_BEAM_SORT_TYPE_STRN_VN                    = "Shear Ratio"

///// Member Sort Type ( Batch Column )
CMB_COLM_SORT_TYPE_SORT_NO                    = "Story / Grouping"
CMB_COLM_SORT_TYPE_STRN_RA                    = "Critical Ratio"
CMB_COLM_SORT_TYPE_STRN_PN                    = "Axial Ratio"
CMB_COLM_SORT_TYPE_STRN_MN                    = "Moment Ratio ( Combined )"
CMB_COLM_SORT_TYPE_STRN_MX                    = "Moment Ratio ( Major, Dir - x )"
CMB_COLM_SORT_TYPE_STRN_MY                    = "Moment Ratio ( Minor, Dir - y )"
CMB_COLM_SORT_TYPE_STRN_VN                    = "Shear Ratio ( Combined )"
CMB_COLM_SORT_TYPE_STRN_VY                    = "Shear Ratio ( Major, Dir - y )"
CMB_COLM_SORT_TYPE_STRN_VX                    = "Shear Ratio ( Minor, Dir - x )"

///// Member Sort Type ( Batch Wall )
CMB_WALL_SORT_TYPE_SORT_NO                    = "Story / Wall Mark"
CMB_WALL_SORT_TYPE_STRN_RA                    = "Critical Ratio"
CMB_WALL_SORT_TYPE_STRN_PN                    = "Axial Ratio"
CMB_WALL_SORT_TYPE_STRN_MN                    = "Moment Ratio"
CMB_WALL_SORT_TYPE_STRN_MX                    = "Moment Ratio ( Mx )"
CMB_WALL_SORT_TYPE_STRN_MY                    = "Moment Ratio ( My )"
CMB_WALL_SORT_TYPE_STRN_VN                    = "Shear Ratio"
CMB_WALL_SORT_TYPE_SEIS_RQ                    = "Seismic Requirement"
